### Terraform Plan Output - Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Validation 🤖`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_virtual_network_peering.rsi-be-to-fe will be created
  + resource "azurerm_virtual_network_peering" "rsi-be-to-fe" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "beTofe"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "rsi-rg"
      + triggers                     = {
          + "remote_address_space" = "10.0.0.0/16"
        }
      + use_remote_gateways          = false
      + virtual_network_name         = (known after apply)
    }

  # azurerm_virtual_network_peering.rsi-fe-to-be will be created
  + resource "azurerm_virtual_network_peering" "rsi-fe-to-be" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "feTobe"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "rsi-rg"
      + triggers                     = {
          + "remote_address_space" = "10.1.0.0/16"
        }
      + use_remote_gateways          = false
      + virtual_network_name         = (known after apply)
    }

  # module.fe-loadbalancer.data.azurerm_resource_group.azlb will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_resource_group" "azlb" {
      + id         = (known after apply)
      + location   = (known after apply)
      + managed_by = (known after apply)
      + name       = "rsi-rg"
      + tags       = (known after apply)
    }

  # module.fe-loadbalancer.azurerm_lb.azlb will be created
  + resource "azurerm_lb" "azlb" {
      + id                   = (known after apply)
      + location             = "uksouth"
      + name                 = "fe-lb"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "rsi-rg"
      + sku                  = "Standard"
      + sku_tier             = "Regional"
      + tags                 = {
          + "Component"   = "Frontend"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }

      + frontend_ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "myPublicIP"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = "10.0.1.10"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.fe-loadbalancer.azurerm_lb_backend_address_pool.azlb will be created
  + resource "azurerm_lb_backend_address_pool" "azlb" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + inbound_nat_rules         = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "BackEndAddressPool"
      + outbound_rules            = (known after apply)
    }

  # module.fe-loadbalancer.azurerm_lb_probe.azlb[0] will be created
  + resource "azurerm_lb_probe" "azlb" {
      + id                  = (known after apply)
      + interval_in_seconds = 5
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "http"
      + number_of_probes    = 2
      + port                = 80
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # module.fe-loadbalancer.azurerm_lb_rule.azlb[0] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 80
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "myPublicIP"
      + frontend_port                  = 80
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 5
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "http"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # module.fe-loadbalancer.azurerm_lb_rule.azlb[1] will be created
  + resource "azurerm_lb_rule" "azlb" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 80
      + disable_outbound_snat          = false
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "myPublicIP"
      + frontend_port                  = 443
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = 5
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "https"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # module.fe-loadbalancer.azurerm_public_ip.azlb[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_public_ip" "azlb" {
      - allocation_method       = "Static" -> null
      - ddos_protection_mode    = "VirtualNetworkInherited" -> null
      - id                      = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/publicIPAddresses/fe-lb-pip" -> null
      - idle_timeout_in_minutes = 4 -> null
      - ip_address              = "4.234.132.155" -> null
      - ip_tags                 = {} -> null
      - ip_version              = "IPv4" -> null
      - location                = "uksouth" -> null
      - name                    = "fe-lb-pip" -> null
      - resource_group_name     = "rsi-rg" -> null
      - sku                     = "Standard" -> null
      - sku_tier                = "Regional" -> null
      - tags                    = {
          - "Component"   = "Frontend"
          - "Region"      = "uk south"
          - "Terraform"   = "true"
          - "environment" = "dev"
        } -> null
      - zones                   = [] -> null
    }

  # module.rsi-be.azurerm_virtual_network.vnet will be destroyed
  # (because azurerm_virtual_network.vnet is not in configuration)
  - resource "azurerm_virtual_network" "vnet" {
      - address_space           = [
          - "10.0.0.0/16",
        ] -> null
      - dns_servers             = [] -> null
      - flow_timeout_in_minutes = 0 -> null
      - guid                    = "c51c7df4-63ac-4ac3-b896-ecc2a844b7df" -> null
      - id                      = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/virtualNetworks/acctvnet" -> null
      - location                = "uksouth" -> null
      - name                    = "acctvnet" -> null
      - resource_group_name     = "rsi-rg" -> null
      - subnet                  = [
          - {
              - address_prefix = "10.0.1.0/24"
              - id             = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/public"
              - name           = "public"
              - security_group = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-public"
            },
          - {
              - address_prefix = "10.0.2.0/24"
              - id             = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/frontend"
              - name           = "frontend"
              - security_group = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-frontend"
            },
        ] -> null
      - tags                    = {
          - "Component"   = "Frontend"
          - "Region"      = "uk south"
          - "Terraform"   = "true"
          - "environment" = "dev"
        } -> null
    }

  # module.rsi-fe.azurerm_subnet.subnet_for_each["frontend"] will be destroyed
  # (because azurerm_subnet.subnet_for_each is not in configuration)
  - resource "azurerm_subnet" "subnet_for_each" {
      - address_prefixes                               = [
          - "10.0.2.0/24",
        ] -> null
      - enforce_private_link_endpoint_network_policies = false -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/frontend" -> null
      - name                                           = "frontend" -> null
      - private_endpoint_network_policies_enabled      = true -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "rsi-rg" -> null
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      - virtual_network_name                           = "acctvnet" -> null
    }

  # module.rsi-fe.azurerm_subnet.subnet_for_each["public"] will be destroyed
  # (because azurerm_subnet.subnet_for_each is not in configuration)
  - resource "azurerm_subnet" "subnet_for_each" {
      - address_prefixes                               = [
          - "10.0.1.0/24",
        ] -> null
      - enforce_private_link_endpoint_network_policies = false -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/public" -> null
      - name                                           = "public" -> null
      - private_endpoint_network_policies_enabled      = true -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "rsi-rg" -> null
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      - virtual_network_name                           = "acctvnet" -> null
    }

  # module.rsi-fe.azurerm_subnet_network_security_group_association.vnet["frontend"] will be destroyed
  # (because azurerm_subnet_network_security_group_association.vnet is not in configuration)
  - resource "azurerm_subnet_network_security_group_association" "vnet" {
      - id                        = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/frontend" -> null
      - network_security_group_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-frontend" -> null
      - subnet_id                 = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/frontend" -> null
    }

  # module.rsi-fe.azurerm_subnet_network_security_group_association.vnet["public"] will be destroyed
  # (because azurerm_subnet_network_security_group_association.vnet is not in configuration)
  - resource "azurerm_subnet_network_security_group_association" "vnet" {
      - id                        = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/public" -> null
      - network_security_group_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-public" -> null
      - subnet_id                 = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/public" -> null
    }

  # module.rsi-fe.azurerm_subnet_route_table_association.vnet["frontend"] will be destroyed
  # (because azurerm_subnet_route_table_association.vnet is not in configuration)
  - resource "azurerm_subnet_route_table_association" "vnet" {
      - id             = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/frontend" -> null
      - route_table_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/routeTables/rsi-rt-fe" -> null
      - subnet_id      = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/frontend" -> null
    }

  # module.rsi-fe.azurerm_subnet_route_table_association.vnet["public"] will be destroyed
  # (because azurerm_subnet_route_table_association.vnet is not in configuration)
  - resource "azurerm_subnet_route_table_association" "vnet" {
      - id             = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/public" -> null
      - route_table_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/routeTables/rsi-rt-fe" -> null
      - subnet_id      = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/public" -> null
    }

  # module.rsi-fe.azurerm_virtual_network.vnet will be destroyed
  # (because azurerm_virtual_network.vnet is not in configuration)
  - resource "azurerm_virtual_network" "vnet" {
      - address_space           = [
          - "10.0.0.0/16",
        ] -> null
      - dns_servers             = [] -> null
      - flow_timeout_in_minutes = 0 -> null
      - guid                    = "c51c7df4-63ac-4ac3-b896-ecc2a844b7df" -> null
      - id                      = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/virtualNetworks/acctvnet" -> null
      - location                = "uksouth" -> null
      - name                    = "acctvnet" -> null
      - resource_group_name     = "rsi-rg" -> null
      - subnet                  = [
          - {
              - address_prefix = "10.0.1.0/24"
              - id             = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/public"
              - name           = "public"
              - security_group = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-public"
            },
          - {
              - address_prefix = "10.0.2.0/24"
              - id             = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/virtualNetworks/acctvnet/subnets/frontend"
              - name           = "frontend"
              - security_group = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-frontend"
            },
        ] -> null
      - tags                    = {
          - "Component"   = "Frontend"
          - "Region"      = "uk south"
          - "Terraform"   = "true"
          - "environment" = "dev"
        } -> null
    }

  # module.rsi-vnet-be.azurerm_subnet.subnet_for_each["backend"] will be created
  + resource "azurerm_subnet" "subnet_for_each" {
      + address_prefixes                               = [
          + "10.1.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "backend"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rsi-rg"
      + virtual_network_name                           = "rsi-be-vnet"
    }

  # module.rsi-vnet-be.azurerm_subnet_network_security_group_association.vnet["backend"] will be created
  + resource "azurerm_subnet_network_security_group_association" "vnet" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-backend"
      + subnet_id                 = (known after apply)
    }

  # module.rsi-vnet-be.azurerm_subnet_route_table_association.vnet["backend"] will be created
  + resource "azurerm_subnet_route_table_association" "vnet" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/routeTables/rsi-rt-be"
      + subnet_id      = (known after apply)
    }

  # module.rsi-vnet-be.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "rsi-be-vnet"
      + resource_group_name = "rsi-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "Component"   = "Backend"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
    }

  # module.rsi-vnet-fe.azurerm_subnet.subnet_for_each["frontend"] will be created
  + resource "azurerm_subnet" "subnet_for_each" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "frontend"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rsi-rg"
      + virtual_network_name                           = "rsi-fe-vnet"
    }

  # module.rsi-vnet-fe.azurerm_subnet.subnet_for_each["public"] will be created
  + resource "azurerm_subnet" "subnet_for_each" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "public"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rsi-rg"
      + virtual_network_name                           = "rsi-fe-vnet"
    }

  # module.rsi-vnet-fe.azurerm_subnet_network_security_group_association.vnet["frontend"] will be created
  + resource "azurerm_subnet_network_security_group_association" "vnet" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-frontend"
      + subnet_id                 = (known after apply)
    }

  # module.rsi-vnet-fe.azurerm_subnet_network_security_group_association.vnet["public"] will be created
  + resource "azurerm_subnet_network_security_group_association" "vnet" {
      + id                        = (known after apply)
      + network_security_group_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/networkSecurityGroups/rsi-nsg-public"
      + subnet_id                 = (known after apply)
    }

  # module.rsi-vnet-fe.azurerm_subnet_route_table_association.vnet["frontend"] will be created
  + resource "azurerm_subnet_route_table_association" "vnet" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/routeTables/rsi-rt-fe"
      + subnet_id      = (known after apply)
    }

  # module.rsi-vnet-fe.azurerm_subnet_route_table_association.vnet["public"] will be created
  + resource "azurerm_subnet_route_table_association" "vnet" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/d2e80279-0f23-4ab1-a876-0206dad47c40/resourceGroups/rsi-rg/providers/Microsoft.Network/routeTables/rsi-rt-fe"
      + subnet_id      = (known after apply)
    }

  # module.rsi-vnet-fe.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "rsi-fe-vnet"
      + resource_group_name = "rsi-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "Component"   = "Frontend"
          + "Region"      = "uk south"
          + "Terraform"   = "true"
          + "environment" = "dev"
        }
    }

Plan: 18 to add, 0 to change, 9 to destroy.

  ```
  </details>
  *Pusher: @MartyFox, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform Pull Request Plan`*